# ================= Выод в консоль / экран ================= #
# a = 5
# b = 5.89
# c = 'hello'
# print(a,' - ',b,' - ',c)
# print(f"{a} - {b} - {c}")
# print("{} - {} - {}".format(a,b,c))

# ================= Ввод из консоли ================= #
# print('Введите первую строку')
# a = input()
# print(a)

# ================= Сложение строк ================= #
# print('Введите первое число')
# a = input() # 123
# b = input('Введите второе число: ') # 456
# print(a) # 123
# print(b) # 456
# print(a+b) # 123456

# ================= Приведение типов ================= #
# c = 5.89
# print(c) # c + '56' = ошибка
# print(type(c)) # float
# c = int(c)
# print(c) # c = 5
# print(type(c)) # int
# c = 1
# print(c)
# c = bool(c)
# print(c) # True

# ================= Сложение с приведением типов ================= #
# print('Введите первое число')
# a = int(input()) # 123
# b = int(input('Введите второе число: ')) # 456
# print(a) # 123
# print(b) # 456
# print(a+b) # 579

# ================= Ограничение кол-ва знаков ================= #
# a = 5.89956
# b = 6.556551
# print(round(a*b,3)) # 3 знака после точки

# ================= Сокращенное присваивание ================= #
# iter = 2
# iter += 3
# iter -= 4
# iter *= 5
# iter /= 6
# iter //= 7 # целочисленное деление
# iter %= 8  # остаток от деления
# iter **= 9 # Возведение в степень

# ================= Логические выражения ================= #
# a = 1 > 4
# print(a)
# a = 1 < 4 and 5 > 2
# print(a)
# a = 1 == 2
# print(a)
# a = 1 != 2
# print(a)
# a = 'qwe'
# b = 'qwe'
# print(a==b)
# a = 1 < 3 < 5 < 10
# print(a)

# ================= Управляющие выполнением ================= #
# username = input('Ввдите имя пользователя: ')
# if username == 'Маша':
#     print('Ураб это Маша')
# elif username == 'Марина':
#     print('Я так ждала Вас, Марина!')
# elif username == 'Ильнар':
#     print('Ильнар - топ')
# else:
#     print('Привет, ', username)

# ================= Цикл WHILE ================= #
# n = 423
# summa = 0
# while n > 0:
#     x = n % 10
#     summa += x
#     n //= 10
# print(summa) # 9

# ================= Цикл WHILE - ELSE ================= #
# i = 0
# while i < 0:
#     if i == 3:
#         break
#     i = i + 1 # i+=1
# else:
#     print('Пожалуй')
#     print('хватит')
# print(i)

# ================= ФЛАГИ ================= #
# n = int(input())
# flag = True
# while flag:
#     if n % i == 0: # если остаток от деления n на i равен 0
#         flag = False
#         print(i)
#     elif i > n // 2: # делитель числа не может превышать введенное число, деленное на 2
#         print(n)
#         flag = False
#     i += 1

# ================= Цикл FOR ================= #
# for i in 1, -2, 3, 14, 5:
#     print(i)

# # range(начало, конец, шаг)
# r = range(5)        # 0 1 2 3 4
# r = range(2, 5)     # 2 3 4
# r = range(0,-5)     # -----
# r = range(1,10,2)   # 1 3 5 7
# r = range(100, 0, -20) # 100 80 60 40 20

# for i in r:
#     print(i)

# a = 'qwerty'
# print(a[0]) # q
# print(a[3]) # e
# for i in a:
#     print(i)

# line = ""
# for i in range(5):
#     line = ""
#     for j in range(5):
#         line += "*"
#     print(line)

# ================= СТРОКИ ================= #
# text = "СъЕШЬ ещё этих МяГкИх французских булочек"
# print(len(text))
# print('еще' in text)
# print(text.lower())
# print(text.upper())
# print(text.replace('ещё','ЕЩЁ'))

# ================= СРЕЗЫ СТРОК ================= #
# text = 'съешь ещё этих мягких французских булочек'
# print(text[0])              # с
# print(text[1])              # ъ
# print(text[len(text)-1])    # к
# print(text[-5])             # л
# print(text[:])              # съешь ещё этих мягких французских булочек
# print(text[:2])             # съ
# print(text[len(text)-2:])   # ек
# print(text[2:9])            # ешь еще
# print(text[6:-18])          # ещё этих мягких ф
# print(text[0:len(text):6])  # сеикакл
# print(text[::6])            # сеикакл
# text = text[2:9] + text[-5] + text[:2]  # ...
# print(text) # ешь ещёлсъ

# print(text[len(text)-1])    # к - последний от начала
# print(text[-1])             # к - первый от конца (обратный счет)
